snlkuharlocal/src/Documents/ПриказНаПодписьСФ/ПриказНаПодписьСФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказНаПодписьСФ</name>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСписокДоверенностей</name>
    <comment>&quot;да&quot; - список, &quot;нет&quot; - приказ на подпись </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДоверенности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоверенности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДействияДоверенности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МЧД</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерМЧД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнфСистема</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MchdFileName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MchdFile</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>MchdSignature</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКфайлуМЧД</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ДоверенностиНаПодпись/ДоверенностиНаПодпись.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоверенностиНаПодпись</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОкончанияДействияДоверенности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаДоверенности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПриказНаПодписьСФ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/НомераМЧД/НомераМЧД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераМЧД</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнфСистема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>MchdFileName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>MchdFile</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>MchdSignature</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПутьКФайлуМЧД</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерМЧД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПриказНаПодписьСФ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ПриказНаПодписьСФ/ObjectModule.bsl
Перем ЕстьИзменения;
Перем НадоПерезаписывать;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	НадоПерезаписывать	=Ложь;
	ЕстьИзменения			=Модифицированность();	
	
	Если Организация.Пустая() Тогда
		Сообщить("Не заполено поле организация!");
		Отказ=истина;
	КонецЕсли;	
	
	Для каждого Сотр из Сотрудники цикл
		
		Если Сотр.сотрудник = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
			Сообщить("По строке "+Сотр.номерСтроки+" - не заполено поле сотрудник!");
			Отказ=истина;
        КонецЕсли;
		
			Если Сотр.ДатаДоверенности = дата(1,1,1) Тогда
			Сообщить("По строке "+Сотр.номерСтроки+" - не заполено поле дата доверенности!");
			Отказ=истина;
        КонецЕсли;

			Если Сотр.ДатаОкончанияДействияДоверенности = дата(1,1,1) Тогда
			Сообщить("По строке "+Сотр.номерСтроки+" - не заполено поле дата окончания доверенности!");
			Отказ=истина;
        КонецЕсли;
   	
	            
	КонецЦикла;
	
	Для каждого Сотр из МЧД цикл
		
		Если Сотр.сотрудник = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
			Сообщить("По строке МЧД"+Сотр.номерСтроки+" - не заполено поле сотрудник!");
			Отказ=истина;
        КонецЕсли;
		
			Если Сотр.ДатаНачала = дата(1,1,1) Тогда
			Сообщить("По строке МЧД "+Сотр.номерСтроки+" - не заполено поле дата доверенности!");
			Отказ=истина;
        КонецЕсли;

		Если Сотр.ДатаОкончания = дата(1,1,1) Тогда
			Сообщить("По строке МЧД "+Сотр.номерСтроки+" - не заполено поле дата окончания доверенности!");
			Отказ=истина;
        КонецЕсли;
   	
	    Если Сотр.ИнфСистема = "" Тогда
			Сообщить("По строке МЧД "+Сотр.номерСтроки+" - не заполено поле информационная система!");
			Отказ=истина;
        КонецЕсли;
		
		Если Сотр.MchdFileName = "" Тогда
			Сообщить("По строке МЧД "+Сотр.номерСтроки+" - не заполено имя файла МЧД!");
			Отказ=истина;
        КонецЕсли;
		
		Если Сотр.MchdFile.Получить() = неопределено Тогда
			Сообщить("По строке МЧД "+Сотр.номерСтроки+" - не заполен файл МЧД!");
			Отказ=истина;
        КонецЕсли;
		
		Если Сотр.MchdSignature.Получить() = неопределено Тогда
			Сообщить("По строке МЧД "+Сотр.номерСтроки+" - не заполен файл подписи МЧД!");
			Отказ=истина;
        КонецЕсли;

		
		
	КонецЦикла;

	
	Если НЕ ОбменДанными.Загрузка Тогда
		//КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ);	
		
		Если Отказ Тогда Возврат КонецЕсли;
		
	КонецЕсли;
	
	
	Если НЕ ЕстьИзменения Тогда Возврат КонецЕсли;
	
	
	КонецПроцедуры

Процедура ПриЗаписи(Отказ)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Если Не Отказ Тогда
		
		Для Каждого Сотр из Сотрудники цикл
			
			Запись				=РегистрыСведений.ДоверенностиНаПодпись.СоздатьМенеджерЗаписи();
			Запись.Период		=Дата;
			Запись.ДатаДоверенности		=Сотр.ДатаДоверенности;
			Запись.ДатаОкончанияДействияДоверенности	=Сотр.ДатаОкончанияДействияДоверенности;
			Запись.Сотрудник		=сотр.Сотрудник;
			Запись.Организация		=организация;
			Запись.Документ		=Ссылка;
			Запись.НомерДоверенности =Сотр.НомерДоверенности;
			Запись.Регистратор	=ссылка;
			
			Запись.Записать();
			
		конецЦикла;	
		Для Каждого Сотр из МЧД  цикл
			
			Запись				=РегистрыСведений.НомераМЧД.СоздатьМенеджерЗаписи();
			Запись.Период		=Сотр.ДатаНачала;
			Запись.ДатаНачала		=Сотр.ДатаНачала;
			Запись.ДатаОкончания	=Сотр.ДатаОкончания;
			Запись.ФизЛицо		=сотр.Сотрудник;
			Запись.Организация		=организация;
			Запись.Документ		=Ссылка;
			Запись.НомерМЧД =Сотр.НомерМЧД;
			Запись.регистратор	=ссылка;
			запись.MchdFile = сотр.MchdFile;
			запись.MchdFileName = сотр.MchdFileName;
			запись.MchdSignature = сотр.MchdSignature;
			запись.ИнфСистема = сотр.ИнфСистема;
			запись.ПутьКфайлуМЧД = сотр.ПутьКфайлуМЧД;
						
			Запись.Записать();
			
		конецЦикла;	
	конецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Набор=РегистрыСведений.ДоверенностиНаПодпись.СоздатьНаборЗаписей();
	Набор.Отбор.документ.Установить(Ссылка);
	Набор.Записать();
	
	Набор=РегистрыСведений.НомераМЧД.СоздатьНаборЗаписей();
	Набор.Отбор.документ.Установить(Ссылка);
	Набор.Записать();
 		
КонецПроцедуры
